app/controllers/products_controller.rb

  def show
    @flavors = Flavor.all
---
SELECT "flavors".* FROM "flavors" WHERE "flavors"."product_id" = ?  [["product_id", 1]]

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Bright Greens"], ["price", #<BigDecimal:7fc83e2ff6a8,'0.599E1',18(27)>], ["created_at", 2016-09-16 02:39:03 UTC], ["updated_at", 2016-09-16 02:39:03 UTC]]