app/views/products/show.html.erb

  <%= render 'flavors/form', locals: { flavor: @flavor } %>
  <% @product.flavors.each do |flavor| %>
---
SELECT "flavors".* FROM "flavors" WHERE "flavors"."product_id" = ?  [["product_id", 1]]